# Missing value

## 1. Detect the missing value

In [1]:
import pandas as pd
df = pd.read_excel('dataset.xlsx', sheet_name='missing')

In [3]:
df

   Sex  Height
0    F   162.0
1    M   162.0
2    F   163.0
3    M   165.0
4    M   167.0
5    M   165.0
6    M   169.0
7    F   155.0
8    M   163.0
9    M   166.0
10   M   162.0
11   M   166.0
12   F   164.0
13   F   164.0
14   F   161.0
15   M   171.0
16   F   160.0
17   F   151.0
18   F   162.0
19   M   170.0
20   M   165.0
21   M     NaN
22   F   158.0
23   M   161.0
24   F   159.0
25   F   161.0
26   F   156.0
27   M   166.0
28   F     NaN
29   F   156.0
30   F   152.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sex     31 non-null     object
 1   Height  29 non-null     float64
dtypes: float64(1), object(1)
memory usage: 628.0+ bytes

In [5]:
df.isna().sum()

Sex       0
Height    2
dtype: int64

In [6]:
df[df.isna().any(axis=1)]

   Sex  Height
21   M     NaN
28   F     NaN

## 2. เติมค่า NaN ด้วย mean

In [8]:
df_fill_with_mean = df.copy()

In [9]:
df_fill_with_mean[df_fill_with_mean.isna().any(axis=1)]

   Sex  Height
21   M     NaN
28   F     NaN

In [10]:
avg_height = df_fill_with_mean['Height'].mean()

In [11]:
avg_height

162.13793103448276

In [12]:
df_fill_with_mean['Height'] = df_fill_with_mean['Height'].fillna(avg_height)

In [13]:
df_fill_with_mean.isna().sum()

Sex       0
Height    0
dtype: int64

In [14]:
df_fill_with_mean.iloc[[21,28]]

   Sex      Height
21   M  162.137931
28   F  162.137931

In [15]:
df_fill_with_mean[df.isna().any(axis=1)]

   Sex      Height
21   M  162.137931
28   F  162.137931

##  3. เติมค่า NaN ด้วย mean ตาม Group

In [23]:
df_fill_with_mean_of_group = df.copy()
M = df_fill_with_mean_of_group.loc[df_fill_with_mean_of_group['Sex'] == 'M']
F = df_fill_with_mean_of_group.loc[df_fill_with_mean_of_group['Sex'] == 'F']

In [31]:
import numpy as np
avg_M = np.average(M['Height'].dropna())
avg_F = np.average(F['Height'].dropna())

In [36]:
def replace_height(x):
    sex = x[0]
    h = x[1]
    if pd.isnull(h):
        if sex == 'M':
            return M.mean()
        elif sex == 'F':
            return F.mean()
    else:
        return h

In [37]:
df_fill_with_mean_of_group.isna().sum()

Sex       0
Height    0
dtype: int64

In [38]:
df_fill_with_mean_of_group[df.isna().any(axis=1)]

   Sex                               Height
21   M  Height    165.571429
dtype: float64
28   F  Height    158.933333
dtype: float64

## 4. เติมค่า NaN ด้วย scikid learn

In [39]:
df_sklearn = df.copy()

In [40]:
from sklearn.impute import SimpleImputer
my_fill_tech = SimpleImputer(strategy = 'median')
fill_data = my_fill_tech.fit_transform(df_sklearn.drop('Sex',axis=1))

In [41]:
df_sklearn['Height']=pd.DataFrame(fill_data)

In [42]:
df_sklearn.isna().sum()

Sex       0
Height    0
dtype: int64

In [43]:
df_sklearn[df.isna().any(axis=1)]

   Sex  Height
21   M   162.0
28   F   162.0

## 5. Filling the N/A value for caterical data

In [44]:
df = pd.read_excel('dataset.xlsx', sheet_name='missing2')

In [45]:
df_category = df.copy()

In [46]:
df_category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sex     29 non-null     object
 1   Height  31 non-null     int64
dtypes: int64(1), object(1)
memory usage: 628.0+ bytes

In [47]:
df_category.isna().sum()

Sex       2
Height    0
dtype: int64

In [48]:
df_category[df_category.isna().any(axis=1)]

   Sex  Height
1  NaN     162
8  NaN     163

In [50]:
len(df[df['Sex']=='F'])

16

In [51]:
from sklearn.impute import SimpleImputer
my_fill_tech = SimpleImputer(strategy = 'most_frequent')
fill_data = my_fill_tech.fit_transform(df_category.drop('Height',axis=1))

In [52]:
df_category['Sex']=pd.DataFrame(fill_data)

In [53]:
df_category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sex     31 non-null     object
 1   Height  31 non-null     int64
dtypes: int64(1), object(1)
memory usage: 628.0+ bytes

In [54]:
df_category[df.isna().any(axis=1)]

  Sex  Height
1   F     162
8   F     163